{
  "sections": {
    "faqs_question-prom": {
      "type": "faqs_question-prom",
      "blocks": {
        "62bbca1c-2898-45be-a567-539ffd05e44b": {
          "type": "question",
          "settings": {
            "title": "What To Do Before Prom?",
            "answer": "<p>Prep up! Spend your free time planning and preparing for prom. Take it one step at a time. Begin with your prom dress, and be sure to check your school’s dress code carefully. If you need to send photos in advance, do that before buying a dress. Then, look for matching accessories, like shoes, prom bag, and jewelry. Make appointments for hair, makeup, and nails. Also, book your ride to and from the venue. Great planning is the key to avoid prom fails. Our prom guide has all the information related to Prom dos and don’ts, so give it a read!<\/p>"
          }
        },
        "e2a85c59-23ed-4e9a-88be-b54ed154b10e": {
          "type": "question",
          "settings": {
            "title": "What To Do At Prom?",
            "answer": "<p>Have the best time of your life. Prom is a celebration of you and your high school career. Expect a lot of dancing, flirting, and a little bit of drama. Stay prepared for dancing and socializing all night and then indulging in the after-prom activities. <\/p>"
          }
        },
        "c713beb8-01dd-40ed-b810-b53fbffde69f": {
          "type": "question",
          "settings": {
            "title": "What Happens At Prom?",
            "answer": "<p>Prom is a celebration of high school goers. An event is conducted by the school authorities and a committee is appointed for the same. It is a formal event that demands everyone to dress formally in prom dresses, long gowns, tuxedos, suits, etc. Exchange of prom flowers is a tradition. Usually, prom queen and king are announced, who perform a dance together and then the floor is opened for all to dance the night away. Some schools also conduct after-prom activities that are comparatively less formal and include eating, drinking, and playing fun games together. <\/p>"
          }
        },
        "2adcb236-73f6-466d-b426-8542557292de": {
          "type": "question",
          "settings": {
            "title": "What Does Prom Mean?",
            "answer": "<p>Prom is a traditional high school event conducted every year around April-May. It is a formal event conducted by the school authorities by appointing a prom committee. Usually, prom is followed by a casual after-prom party. School goers dress up formally in gowns, long dresses, tuxedos, suits etc. and exchange corsages and boutonnieres after having a formal dance. <\/p>"
          }
        },
        "4e849c0b-7623-44bc-babf-08521a391602": {
          "type": "question",
          "settings": {
            "title": "What Prom Dress Should I Wear?",
            "answer": "<p>The dress that abides by the school dress code. There have been cases when students have been asked to leave because of inappropriate attire. It can be very embarrassing and disheartening at the same time. It is highly advised to follow all the instructions given by the school in terms of prom attire. Also, your prom dress should suit your individual style and personality. It shouldn’t make you look like someone you’re not. If you’re elegant and cute, go for a simple a-line prom dress with minimal embellishments, but if you’re bold and bossy, arrive in an eye-catching, figure-flattering ensemble that demands attention. Remember, your dress choice should be in harmony with your school’s dress code.  <\/p>"
          }
        },
        "32d76be6-5312-4ff5-83e5-26116ebf5416": {
          "type": "question",
          "settings": {
            "title": "What To Do After-Prom? What Happens After-Prom? What Do You Do At Prom?",
            "answer": "<p>After prom activities include going to the after-prom school party or going out with a group of close friends or a date. It could be a fun evening party, a sports bar meet, a bowling session, a casual pyjama party, or a romantic dinner date or movie night. All you have to do is either get the after-prom party tickets or make plans with your friends. Our “The Night of Prom” section will answer your questions in detail. <\/p>"
          }
        },
        "aa291bc2-6bd0-484b-af35-3c37de861ebf": {
          "type": "question",
          "settings": {
            "title": "What Color Prom Dress Should I Wear?",
            "answer": "<p>Many colors are trending for Prom 2021! From shades of blue, such as ice blue, lavender, teal, turquoise, navy blue, midnight blue, royal blue, and sky blue, etc. to pink prom dresses, blush, nude, hot pink and baby pink ensembles, blues and pinks will be everywhere. Other than that, burgundy, wine, coral, emerald, sapphire and champagne prom dresses will be selling out fast. Red prom dresses and black ones are evergreen as always. Silver, golden, and metallic colors are other prom favorites for 2021! Wear a color that compliments your skin tone, hair and eye color, and matches your individual style.<\/p>"
          }
        }
      },
      "block_order": [
        "62bbca1c-2898-45be-a567-539ffd05e44b",
        "e2a85c59-23ed-4e9a-88be-b54ed154b10e",
        "c713beb8-01dd-40ed-b810-b53fbffde69f",
        "2adcb236-73f6-466d-b426-8542557292de",
        "4e849c0b-7623-44bc-babf-08521a391602",
        "32d76be6-5312-4ff5-83e5-26116ebf5416",
        "aa291bc2-6bd0-484b-af35-3c37de861ebf"
      ],
      "settings": {
        "expand_questions": false,
        "page_title": "MORE PROM",
        "page_description": "In this section, we will take up all your prom-related queries. From what is prom to what are after-prom activities, we answer it all - in the simplest words possible. Find prom-related advice, dress suggestions, and tips on planning for prom. Refer to our prom guide for detailed suggestions!",
        "page_top_image": "shopify:\/\/shop_images\/prom_faq_new_im.jpg"
      }
    }
  },
  "order": [
    "faqs_question-prom"
  ]
}
